Ran Plan for project: `wrestleutopia-prod` dir: `accounts/wrestleutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # aws_ssm_document.attach_sfn_policy will be updated in-place
~ resource "aws_ssm_document" "attach_sfn_policy" {
      ~ content          = jsonencode(
          ~ {
              ~ description   = "Attach a Step Functions resource-based policy if missing" -> "Attach a resource-based policy to a Step Functions state machine (via Lambda)"
              ~ mainSteps     = [
                  ~ {
                      ~ action = "aws:executeAwsApi" -> "aws:invokeLambdaFunction"
                      ~ inputs = {
                          - Api          = "PutResourcePolicy"
                          + FunctionName = "MyPutResourcePolicyFunction"
                          + Payload      = jsonencode(
                                {
                                  + PolicyJson  = "{{ PolicyJson }}"
                                  + ResourceArn = "{{ ResourceArn }}"
                                }
                            )
                          - Policy       = "{{ PolicyJson }}"
                          - ResourceArn  = "{{ ResourceArn }}"
                          - Service      = "states"
                        }
                      ~ name   = "AttachPolicy" -> "PutResourcePolicyViaLambda"
                    },
                ]
              ~ parameters    = {
                  ~ AutomationAssumeRole = {
                      - description = "(Recommended) The IAM role the runbook will assume. If omitted, the runbook will use the credentials of the user or service calling the runbook."
                        # (1 unchanged attribute hidden)
                    }
                  ~ PolicyJson           = {
                      - description = "The JSON representing the resource policy."
                        # (1 unchanged attribute hidden)
                    }
                  ~ ResourceArn          = {
                      - description = "The ARN of the Step Functions state machine or resource."
                        # (1 unchanged attribute hidden)
                    }
                }
                # (2 unchanged attributes hidden)
            }
        )
      ~ default_version  = "8" -> (known after apply)
      ~ document_version = "8" -> (known after apply)
      ~ hash             = "2f4ef61b4053d70f6b3de4b66ecc802bf1f2ea0caea6b30ffde6a0e6d678c885" -> (known after apply)
        id               = "AttachSFNResourcePolicy"
      ~ latest_version   = "8" -> (known after apply)
        name             = "AttachSFNResourcePolicy"
      ~ parameter        = [
          - {
              - description   = "The ARN of the Step Functions state machine or resource."
              - name          = "ResourceArn"
              - type          = "String"
                # (1 unchanged attribute hidden)
            },
          - {
              - description   = "The JSON representing the resource policy."
              - name          = "PolicyJson"
              - type          = "String"
                # (1 unchanged attribute hidden)
            },
          - {
              - description   = "(Recommended) The IAM role the runbook will assume. If omitted, the runbook will use the credentials of the user or service calling the runbook."
              - name          = "AutomationAssumeRole"
              - type          = "String"
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
        tags             = {}
        # (14 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p wrestleutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fwrestleutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p wrestleutopia-prod
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```